name: "photonObjectBothEnsemble"
platform: "ensemble"
max_batch_size: 0
input [
{
  name: "xECAL"
  data_type: TYPE_FP32
  dims: [-1, 5]
},
{
  name: "fECAL"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "gainECAL"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "gx"
  data_type: TYPE_FP32
  dims: [-1, 2]
},
{
  name: "batchECAL"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "xES"
  data_type: TYPE_FP32
  dims: [-1, 4]
},
{
  name: "fES"
  data_type: TYPE_INT64
  dims: [-1]
},
{
  name: "batchES"
  data_type: TYPE_INT64
  dims: [-1]
}]
output [
{
  name: "mu"
  data_type: TYPE_FP32
  dims: [-1, 6]
},
{
  name: "sigma"
  data_type: TYPE_FP32
  dims: [-1, 5]
}]
ensemble_scheduling{
  step [
  {
    model_name: "photonObjectBoth"
    model_version: -1
    input_map {
      key: "xECAL__0"
      value: "xECAL"
    }
    input_map {
      key: "fECAL__1"
      value: "fECAL"
    }
    input_map {
      key: "gain__2"
      value: "gainECAL"
    }
    input_map {
      key: "xES__3"
      value: "xES"
    }
    input_map {
      key: "fES__4"
      value: "fES"
    }
    input_map {
      key: "graph_x__5"
      value: "gx"
    }
    input_map {
      key: "xECAL_batch__6"
      value: "batchECAL"
    }
    input_map {
      key: "xES_batch__7"
      value: "batchES"
    }
    output_map {
      key: "dscb__0"
      value: "mu"
    }
  },
  {
    model_name: "photonObjectBoth_res"
    model_version: -1
    input_map {
      key: "xECAL__0"
      value: "xECAL"
    }
    input_map {
      key: "fECAL__1"
      value: "fECAL"
    }
    input_map {
      key: "gain__2"
      value: "gainECAL"
    }
    input_map {
      key: "xES__3"
      value: "xES"
    }
    input_map {
      key: "fES__4"
      value: "fES"
    }
    input_map {
      key: "graph_x__5"
      value: "gx"
    }
    input_map {
      key: "xECAL_batch__6"
      value: "batchECAL"
    }
    input_map {
      key: "xES_batch__7"
      value: "batchES"
    }
    output_map {
      key: "dscb__0"
      value: "sigma"
    }
  }
]}
